// Написать программу, которая из 
// имеющегося массива строк 
// формирует массив из строк,
// длинна которых меньше либо равна 3 символа.


string[] firstArray = { "One", "Repo", "Double", "Fin", "Finish" };
Console.WriteLine("Задан массив строк:");
PrintArray(firstArray);
